{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 64, 64, 3], "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_1", "bias": true, "activation": "linear", "subsample": [2, 2], "trainable": true, "nb_row": 5, "input_dtype": "float32", "W_constraint": null, "W_regularizer": null, "b_constraint": null, "nb_filter": 32, "nb_col": 5, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "convolution2d_2", "bias": true, "subsample": [1, 1], "trainable": true, "nb_row": 3, "activation": "linear", "W_constraint": null, "W_regularizer": null, "b_constraint": null, "nb_filter": 16, "nb_col": 3, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.4}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "convolution2d_3", "bias": true, "subsample": [1, 1], "trainable": true, "nb_row": 3, "activation": "linear", "W_constraint": null, "W_regularizer": null, "b_constraint": null, "nb_filter": 16, "nb_col": 3, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.4}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "output_dim": 1024, "trainable": true, "name": "dense_1", "activation": "linear", "W_constraint": null, "W_regularizer": null, "b_constraint": null, "input_dim": 2704}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "output_dim": 512, "trainable": true, "name": "dense_2", "activation": "linear", "W_constraint": null, "W_regularizer": null, "b_constraint": null, "input_dim": 1024}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "output_dim": 1, "trainable": true, "name": "dense_3", "activation": "linear", "W_constraint": null, "W_regularizer": null, "b_constraint": null, "input_dim": 512}}], "keras_version": "1.2.1"}